In [1]:
import pandas as pd
import numpy as np

In [2]:
salary_dict={"Programming Language":["Python","Python","Python","Swift","C","R"],"Name":["A","B","C","D","E","F"],"Salary":[100,90,80,70,60,50]}

In [3]:
salary_frame=pd.DataFrame(salary_dict)

In [4]:
salary_frame

  Programming Language Name  Salary
0               Python    A     100
1               Python    B      90
2               Python    C      80
3                Swift    D      70
4                    C    E      60
5                    R    F      50

In [5]:
group_object=salary_frame.groupby("Programming Language")

In [7]:
group_object.count()

                      Name  Salary
Programming Language
C                        1       1
Python                   3       3
R                        1       1
Swift                    1       1

In [9]:
group_object.min()

                     Name  Salary
Programming Language
C                       E      60
Python                  A      80
R                       F      50
Swift                   D      70

In [10]:
group_object.max()

                     Name  Salary
Programming Language
C                       E      60
Python                  C     100
R                       F      50
Swift                   D      70

In [11]:
group_object.describe()

                     Salary
                      count  mean   std   min   25%   50%   75%    max
Programming Language
C                       1.0  60.0   NaN  60.0  60.0  60.0  60.0   60.0
Python                  3.0  90.0  10.0  80.0  85.0  90.0  95.0  100.0
R                       1.0  50.0   NaN  50.0  50.0  50.0  50.0   50.0
Swift                   1.0  70.0   NaN  70.0  70.0  70.0  70.0   70.0

In [12]:
my_dict1={"Name":["A","B","C","D"],
         "Sports":["Basketball","Football","Tennis","Running"],
         "Calories":[100,200,300,400]
         }

In [13]:
my_frame1=pd.DataFrame(my_dict1)

In [14]:
my_frame1

  Name      Sports  Calories
0    A  Basketball       100
1    B    Football       200
2    C      Tennis       300
3    D     Running       400

In [15]:
my_dict2={"Name":["E","F","G","H"],
         "Sports":["Basketball","Football","Tennis","Running"],
         "Calories":[200,50,330,440]}

In [17]:
my_frame2=pd.DataFrame(my_dict2)

In [18]:
my_frame2

  Name      Sports  Calories
0    E  Basketball       200
1    F    Football        50
2    G      Tennis       330
3    H     Running       440

In [19]:
my_dict3={"Name":["I","J","K","L"],
         "Sports":["Basketball","Football","Tennis","Running"],
         "Calories":[300,150,320,410]}

In [20]:
my_frame3=pd.DataFrame(my_dict3)

In [21]:
my_frame3

  Name      Sports  Calories
0    I  Basketball       300
1    J    Football       150
2    K      Tennis       320
3    L     Running       410

In [22]:
#concatenation

In [25]:
pd.concat([my_frame1,my_frame2,my_frame3])

  Name      Sports  Calories
0    A  Basketball       100
1    B    Football       200
2    C      Tennis       300
3    D     Running       400
0    E  Basketball       200
1    F    Football        50
2    G      Tennis       330
3    H     Running       440
0    I  Basketball       300
1    J    Football       150
2    K      Tennis       320
3    L     Running       410

In [26]:
#merge

In [27]:
my_frame1

  Name      Sports  Calories
0    A  Basketball       100
1    B    Football       200
2    C      Tennis       300
3    D     Running       400

In [28]:
my_frame2

  Name      Sports  Calories
0    E  Basketball       200
1    F    Football        50
2    G      Tennis       330
3    H     Running       440

In [29]:
pd.merge(my_frame1,my_frame2,on="Sports")

  Name_x      Sports  Calories_x Name_y  Calories_y
0      A  Basketball         100      E         200
1      B    Football         200      F          50
2      C      Tennis         300      G         330
3      D     Running         400      H         440

In [30]:
new_salary_frame=pd.DataFrame({"Name":["James","Kirk","Lars"],"Salary":[10,20,30],"Age":[60,65,70]})

In [31]:
new_salary_frame

    Name  Salary  Age
0  James      10   60
1   Kirk      20   65
2   Lars      30   70

In [32]:
new_salary_frame["Name"].unique()

array(['James', 'Kirk', 'Lars'], dtype=object)

In [33]:
new_salary_frame["Name"].nunique()

3

In [34]:
def grossToNet(salary):
    return salary*0.65

In [36]:
new_salary_frame["Salary"].apply(grossToNet)

0     6.5
1    13.0
2    19.5
Name: Salary, dtype: float64